In [14]:
#Ans1:
import numpy as np
data1={'time':[1,2,3,4,5],'score':[30,40,50,60,70]}
import pandas as pd
df1=pd.DataFrame(data1)

In [15]:
corr1=df1.corr(method='pearson')

In [16]:
corr1

       time  score
time    1.0    1.0
score   1.0    1.0

In [7]:
#Ans2:
import pandas as pd
data={'amount':[2,4,5,6,8,9,10,11,15,14],'level':[1,2,3,4,5,6,7,8,9,10]}

In [9]:
df=pd.DataFrame(data)
df.corr(method='spearman')

          amount     level
amount  1.000000  0.987879
level   0.987879  1.000000

In [10]:
df

   amount  level
0       2      1
1       4      2
2       5      3
3       6      4
4       8      5
5       9      6
6      10      7
7      11      8
8      15      9
9      14     10

In [32]:
#Ans3:
data={'hours':[4, 6, 3, 5, 7, 2, 3, 6, 4, 5, 7, 2, 3, 5, 4, 6, 7, 3, 5, 4, 2, 6, 3, 5, 4, 6, 7, 2, 3, 5, 4, 6, 3, 5, 4, 6, 7, 2, 3, 5, 4, 6, 3, 5, 4, 6, 7, 2, 3,4],
     'BMI':[22.5, 24.3, 23.1, 25.8, 26.7, 21.9, 23.5, 24.6, 23.4, 26.2, 27.8, 21.3, 23.6, 24.5, 22.9, 25.4, 26.5, 23.3, 24.8, 23.9, 21.5, 26.4, 23.7, 24.9, 23.7, 26.1, 26.9, 21.4, 23.8, 25.3, 23.6, 25.1, 22.8, 25.6, 24.4, 26.3, 27.1, 21.8, 24.2, 25.7, 23.4, 26.8, 22.1, 24.7, 26.0, 23.2, 26.6, 27.3, 21.7, 24.1]}

In [33]:
l1=[22.5, 24.3, 23.1, 25.8, 26.7, 21.9, 23.5, 24.6, 23.4, 26.2, 27.8, 21.3, 23.6, 24.5, 22.9, 25.4, 26.5, 23.3, 24.8, 23.9, 21.5, 26.4, 23.7, 24.9, 23.7, 26.1, 26.9, 21.4, 23.8, 25.3, 23.6, 25.1, 22.8, 25.6, 24.4, 26.3, 27.1, 21.8, 24.2, 25.7, 23.4, 26.8, 22.1, 24.7, 26.0, 23.2, 26.6, 27.3, 21.7, 24.1, 25.5]

In [34]:
len(l1)

51

In [35]:
l2= [4, 6, 3, 5, 7, 2, 3, 6, 4, 5, 7, 2, 3, 5, 4, 6, 7, 3, 5, 4, 2, 6, 3, 5, 4, 6, 7, 2, 3, 5, 4, 6, 3, 5, 4, 6, 7, 2, 3, 5, 4, 6, 3, 5, 4, 6, 7, 2, 3,4]

In [36]:
len(l2)

50

In [38]:
df3=pd.DataFrame(data)

In [39]:
df3.corr(method='pearson')

          hours       BMI
hours  1.000000  0.771803
BMI    0.771803  1.000000

In [40]:
df3.corr(method='spearman')

          hours       BMI
hours  1.000000  0.766449
BMI    0.766449  1.000000

In [44]:
#Ans4:
data={'hours':[4, 6, 3, 5, 7, 2, 3, 6, 4, 5, 7, 2, 3, 5, 4, 6, 7, 3, 5, 4, 2, 6, 3, 5, 4, 6, 7, 2, 3, 5, 4, 6, 3, 5, 4, 6, 7, 2, 3, 5, 4, 6, 3, 5, 4, 6, 7, 2, 3,4],
     'level':[11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,33,36,39,35,34,36,74,39,54,36,85,74,10,15,12,13,5,6,9,8,7,4,1,4,5,6]}

In [42]:
l=[11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,33,36,39,35,34,36,74,39,54,36,85,74,10,15,12,13,5,6,9,8,7,4,1,4,5,6,7,8]

In [43]:
len(l)

52

In [45]:
df4=pd.DataFrame(data)

In [46]:
df4

    hours  level
0       4     11
1       6     12
2       3     13
3       5     14
4       7     15
5       2     16
6       3     17
7       6     18
8       4     19
9       5     20
10      7     21
11      2     22
12      3     23
13      5     24
14      4     25
15      6     26
16      7     27
17      3     28
18      5     29
19      4     30
20      2     31
21      6     32
22      3     33
23      5     34
24      4     33
25      6     36
26      7     39
27      2     35
28      3     34
29      5     36
30      4     74
31      6     39
32      3     54
33      5     36
34      4     85
35      6     74
36      7     10
37      2     15
38      3     12
39      5     13
40      4      5
41      6      6
42      3      9
43      5      8
44      4      7
45      6      4
46      7      1
47      2      4
48      3      5
49      4      6

In [47]:
df4.corr(method='pearson')

          hours     level
hours  1.000000  0.008428
level  0.008428  1.000000

In [48]:
#Ans5:
data={'Soft drink Preference ':['Coke','Pepsi','Mountain dew','Coke','Pepsi','Coke'],
     'age':[25,42,37,19,31,28]}

In [50]:
dg=pd.DataFrame(data)

In [51]:
dg.corr(method='pearson')

     age
age  1.0

In [60]:
#Ans6:
data={'day':[25,23,27,28,26,32,21,24,25,26,28,30,36,42,52,56,23,28,31,35,39,40,21,25,26,42,58,41,32,23],
     'week':[400,445,449,500,501,502,503,506,587,574,596,601,602,605,708,802,400,405,406,408,409,401,402,400,500,501,502,506,506,507]}

In [ ]:
df8=pd.DataFrame(data)